src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийRunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_LastHeartbeat</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ar_СобытияЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_СобытияЗапуска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_МоментВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_ТипСобытия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_PayloadJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Sequence</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ar_ДействияАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ДействияАгента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_ИмяИнструмента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АргументыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_RiskLevel</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_УровеньРиска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ResultRef</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ApprovedBy</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ApprovedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ДлительностьМС</Name>
					<Comment>Длительность вызова tool в миллисекундах: от начала выполнения реализации до возврата результата или исключения. Заполняется ВСЕГДА, независимо от флага ar_ЗамерПроизводительности и наличия подсистемы БСП "Оценка производительности". 0 означает "не измерено" (например запись создана не из ar_ИнструментыДиспетчер.Вызвать). PERF-04.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершёнСОшибкой</Name>
					<Comment>Вызов завершился ошибкой: исключение реализации либо observation с ключом "error". Нужен для статистики PERF-05 - сам текст observation в регистре не хранится, восстановить признак постфактум нельзя.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Sequence</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonForms/ar_ПросмотрЗапуска/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общая форма ar_ПросмотрЗапуска («Просмотр запуска» / «Run viewer») — UI-10/UI-11.
//
// Диагностический инструмент: показывает полную историю одного запуска агента
// (РегистрСведений.ar_Запуски) в виде мастер-детального дерева
// «Запуск → События → Tool calls» (Plan §4.4). Узел 1 уровня — сам запуск,
// узлы 2 уровня — слитый хронологический список событий (ar_СобытияЗапуска)
// и вызовов tools (ar_ДействияАгента), отсортированный по ar_Sequence.
// При выборе узла боковая панель показывает релевантные детали.
//
// Открывается программно с параметром RunId (строка) либо ключом записи
// регистра ar_Запуски (стандартная навигация «Перейти к» из списка).
//
// UI-11 — команда ar_ПоказатьPrompt / КнопкаПоказатьPrompt: для узла «Событие»
// с ar_ТипСобытия = LLMCalled и непустым массивом "messages" в ar_PayloadJSON
// кнопка становится видимой (ОбновитьВидимостьКнопкиPrompt). Нажатие открывает
// CommonForm.ar_ФормаПросмотраPrompt (ОткрытьФорму, БлокироватьОкноВладельца) с полным
// (без 500-символьной обрезки ar_Утилиты.МаскироватьСекреты) pretty-print JSON
// массива сообщений prompt и оценкой токенов (ar_Токены через форму UI-03).
//
// UI-12 — ДекорацияHeartbeat: показывает «Heartbeat: N сек назад» вместо сырой
// даты ar_LastHeartbeat. Для незавершённых запусков (статус не финальный)
// подключается клиентский таймер (ПодключитьОбработчикОжидания, интервал 5 сек,
// см. ПриОткрытии/ОбновитьHeartbeat) — индикатор «тикает» без обращения к
// серверу (вариант A из спеки: пересчёт на клиенте от ШапкаLastHeartbeat,
// прочитанного один раз при открытии формы). Для финальных статусов
// (Completed/Failed/Cancelled/MaxStepsReached/DeniedGlobally/Interrupted/
// FailedIncompatibleState) таймер не подключается — текст вычисляется один раз
// на сервере и далее не растёт (см. СтатусФинальный, ЗаполнитьШапку).
//
// ТОЧКИ РАСШИРЕНИЯ (зарезервированы в разметке, НЕ реализованы):
//   * UI-13 — команда ar_Возобновить / КнопкаВозобновить: видима только при
//     статусе Interrupted, но обработчик-заглушка не вызывает ar_RuntimeЗапуск —
//     это предмет отдельного DoD UI-13. ПРИМЕЧАНИЕ для разработчика UI-13:
//     обработчик ОбновитьHeartbeat (таймер, подключаемый в ПриОткрытии) можно
//     переиспользовать для периодического обновления видимости/состояния
//     КнопкаВозобновить при автообновлении — не обязательно для UI-12.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Ветка автотеста: при программном открытии формы тестами пропускаем
	// инициализацию (единый паттерн форм расширения, см. ar_ФормаПросмотраPrompt).
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// КнопкаПоказатьPrompt (UI-11) скрыта по умолчанию — становится видимой
	// при активизации строки дерева, соответствующей LLMCalled с messages
	// (см. ОбновитьВидимостьКнопкиPrompt).
	// КнопкаВозобновить (UI-13) — точка расширения, обработчик-заглушка.
	Элементы.КнопкаПоказатьPrompt.Видимость = Ложь;
	Элементы.КнопкаВозобновить.Видимость = Ложь;

	RunId = ОпределитьRunIdИзПараметров();

	Если ПустаяСтрока(RunId) Тогда
		ПоказатьЗаглушкуНеНайдено();
		Возврат;
	КонецЕсли;

	Шапка = ПрочитатьШапкуЗапуска(RunId);
	Если Шапка = Неопределено Тогда
		ПоказатьЗаглушкуНеНайдено();
		Возврат;
	КонецЕсли;

	ЗаполнитьШапку(Шапка);
	ПостроитьДерево(RunId);

	// CONS-06: секции «Созданные объекты 1С» и «Ожидает подтверждения» строятся
	// отдельными целевыми запросами, а не выборкой из уже построенного дерева
	// (там представление урезано под нужды дерева) - см. .docs/specs/CONS-06.md.
	ЗаполнитьСозданныеОбъекты(RunId);
	ЗаполнитьОжидаетПодтверждения(RunId);

	Заголовок = СтрШаблон(
		НСтр("ru = 'Запуск %1 — %2'; en = 'Run %1 — %2'"),
		RunId, Строка(Шапка.Статус));

	Элементы.ГруппаДетали.ТекущаяСтраница = Элементы.СтраницаДеталиПусто;

	// UI-13: команда «Возобновить» резервируется видимой только для Interrupted.
	// Сравнение со значением перечисления (а не со строкой) — устойчиво к локализации.
	Если Шапка.Статус = Перечисления.ar_СтатусЗапуска.Interrupted Тогда
		Элементы.КнопкаВозобновить.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

// UI-12: подключает клиентский таймер автообновления индикатора heartbeat.
//
// Подключается только если ЗаполнитьШапку признала это необходимым
// (ШапкаHeartbeatАктивен = Истина): LastHeartbeat заполнен и статус запуска не
// финальный. Для АвтоТест/«запуск не найден»/финальных статусов реквизит
// остаётся Ложь (значение по умолчанию для Булево) — таймер не подключается.
//
// ИнтервалHeartbeatСек (5 секунд) — компромисс между «живостью» индикатора и
// нагрузкой на клиент при нескольких одновременно открытых формах Run Viewer
// (вариант A — пересчёт чисто клиентский, без серверного round-trip, см.
// ОбновитьHeartbeat).
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ШапкаHeartbeatАктивен Тогда
		ПодключитьОбработчикОжидания("ОбновитьHeartbeat", ИнтервалHeartbeatСек(), Ложь);
	КонецЕсли;

	// Развернуть корневой узел запуска (он один) - Развернуть() клиентский метод,
	// не может вызываться из серверного ПостроитьДерево (см. её комментарий).
	Для Каждого СтрокаКорня Из ДеревоШагов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоШагов.Развернуть(СтрокаКорня.ПолучитьИдентификатор(), Истина);
	КонецЦикла;

КонецПроцедуры

// UI-12: снимает таймер автообновления при закрытии формы.
//
// Платформа сама отключает обработчики ожидания при закрытии формы (штатное
// поведение), однако явное ОтключитьОбработчикОжидания — защитный приём на
// случай повторного подключения (например, если форма переоткрывается без
// полного пересоздания) и соответствует рекомендации AI-аудита UI-12.
//
&НаКлиенте
Процедура ПриЗакрытии()

	Если ШапкаHeartbeatАктивен Тогда
		ОтключитьОбработчикОжидания("ОбновитьHeartbeat");
	КонецЕсли;

КонецПроцедуры

// UI-12: периодический пересчёт текста ДекорацияHeartbeat «на тике» таймера.
//
// Пересчёт выполняется полностью на клиенте — без обращения к серверу
// (вариант A): N = Цел(ТекущаяДата() - ШапкаLastHeartbeat), формула совпадает с
// серверной ПредставлениеHeartbeat (используемой при первом заполнении в
// ЗаполнитьШапку). ШапкаLastHeartbeat — серверное время (ТекущаяДатаСеанса()
// на момент ar_AuditЗапуски.Heartbeat), ТекущаяДата() — клиентское (платформенный
// глобальный метод, доступный в клиентском контексте; ТекущаяДатаСеанса —
// серверный, здесь неприменим). Для типовых инсталляций 1С (клиент/сервер
// синхронизированы по NTP) расхождение несущественно (см. «Риски» в спеке UI-12).
//
&НаКлиенте
Процедура ОбновитьHeartbeat()

	Элементы.ДекорацияHeartbeat.Заголовок = ПредставлениеHeartbeatНаКлиенте(
		ШапкаLastHeartbeat, ТекущаяДата());

КонецПроцедуры

// UI-12: интервал клиентского таймера автообновления индикатора heartbeat, сек.
// Выделен в отдельную функцию вместо магического числа в ПодключитьОбработчикОжидания.
// Выбран компромисс между «живостью» индикатора (1 сек, см. п.5 спеки UI-12) и
// нагрузкой при нескольких одновременно открытых формах Run Viewer (5 сек —
// нижняя половина рекомендованного спекой диапазона 1-15 сек).
//
// Возвращаемое значение:
//   Число - интервал автообновления в секундах.
//
&НаКлиенте
Функция ИнтервалHeartbeatСек()
	Возврат 5;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДеревоШаговПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.ДеревоШагов.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ГруппаДетали.ТекущаяСтраница = Элементы.СтраницаДеталиПусто;
		Элементы.КнопкаПоказатьPrompt.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	ОбновитьДеталиУзла(ТекущиеДанные.ПолучитьИдентификатор());
	ОбновитьВидимостьКнопкиPrompt(ТекущиеДанные);

КонецПроцедуры

// UI-11: видимость КнопкаПоказатьPrompt — только для узлов «Событие» с
// ar_ТипСобытия = LLMCalled и непустым массивом messages в payload.
// ТипСобытияИмя читается из дерева (без серверного запроса), наличие messages
// проверяется отдельным дешёвым серверным вызовом.
//
// Параметры:
//   ТекущиеДанные - СтрокаДереваЗначений - текущая строка реквизита формы
//                   ДеревоШагов (колонки Тип, ТипСобытияИмя, Sequence).
//
&НаКлиенте
Процедура ОбновитьВидимостьКнопкиPrompt(Знач ТекущиеДанные)

	Если ТекущиеДанные.Тип <> "Событие"
		Или ТекущиеДанные.ТипСобытияИмя <> "LLMCalled" Тогда
		Элементы.КнопкаПоказатьPrompt.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	Элементы.КнопкаПоказатьPrompt.Видимость = ЕстьСообщенияPromptДляУзлаНаСервере(ТекущиеДанные.Sequence);

КонецПроцедуры

&НаКлиенте
Процедура ПолеToolResultRefНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если ПустаяСтрока(ДетальToolResultRef) Тогда
		Возврат;
	КонецЕсли;

	Объект = ОбъектИзНавигационнойСсылкиНаСервере(ДетальToolResultRef);

	Если Объект = Неопределено Тогда
		// Не навигационная ссылка — показываем как текст, открыть нечего.
		ПоказатьПредупреждение(, НСтр(
			"ru = 'Результат не является ссылкой на объект и показан как текст.';
			|en = 'Result is not an object reference and is shown as text.'"));
		Возврат;
	КонецЕсли;

	// ОткрытьЗначение синхронный (модальный) - заменён на асинхронный аналог.
	ПоказатьЗначение(, Объект);

КонецПроцедуры

// CONS-06 (D2): клик/выбор строки секции «Созданные объекты 1С» открывает объект.
// Переиспользует тот же приём, что и ПолеToolResultRefНажатие выше - серверное
// разыменование через ar_Утилиты.ОбъектИзНавигационнойСсылки (round-trip фикс
// ROREF-01/03) + асинхронный ПоказатьЗначение. Для значений, которые не удалось
// разыменовать (не навигационная ссылка) - ничего не открываем, текст и так
// показан в колонке ОбъектТекст (см. ЗаполнитьСозданныеОбъекты).
//
&НаКлиенте
Процедура СозданныеОбъектыВыборСтроки(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.СозданныеОбъекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.НавигационнаяСсылка) Тогда
		Возврат;
	КонецЕсли;

	Объект = ОбъектИзНавигационнойСсылкиНаСервере(ТекущиеДанные.НавигационнаяСсылка);

	Если Объект = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр(
			"ru = 'Результат не является ссылкой на объект и показан как текст.';
			|en = 'Result is not an object reference and is shown as text.'"));
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, Объект);

КонецПроцедуры

// CONS-06: при переключении строки секции «Ожидает подтверждения» пересчитывает
// доступность кнопок «Подтвердить»/«Отклонить» - для решённых записей (история,
// ЭтоИстория = Истина) команды принятия решения недоступны (D4), повторное
// решение по уже обработанной записи бессмысленно и приведёт к status_mismatch
// в ar_Approval.Принять/Отклонить.
//
// Параметры:
//   Элемент - ПолеТабличногоДокумента, Таблица - элемент формы ОжидаетПодтверждения
//             (стандартный параметр события ПриАктивизацииСтроки, не используется).
//
&НаКлиенте
Процедура ОжидаетПодтвержденияПриАктивизацииСтроки(Элемент)

	ОбновитьДоступностьКнопокApproval();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// UI-11: модальный просмотр полного prompt (массив сообщений LLM-вызова) для
// выбранного узла «Событие»/LLMCalled. Переиспользует CommonForm.ar_ФормаПросмотраPrompt
// (UI-03) — вкладки «Системный»/«Инструкция» скрываются (UI-11 показывает фактический
// массив сообщений запуска, а не сборку системного prompt агента).
//
// Параметры:
//   Команда - КомандаФормы - команда формы ar_ПоказатьPrompt (параметры не используются).
//
&НаКлиенте
Процедура ar_ПоказатьPrompt(Команда)

	ТекущиеДанные = Элементы.ДеревоШагов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Защитная проверка: команда осмыслена только для узлов «Событие» (LLMCalled) —
	// кнопка для остальных узлов скрыта (ОбновитьВидимостьКнопкиPrompt), но
	// команда формы технически может быть вызвана и иначе (например, с клавиатуры).
	Если ТекущиеДанные.Тип <> "Событие" Тогда
		Возврат;
	КонецЕсли;

	РезультатПросмотра = ПолучитьPromptДляУзлаНаСервере(ТекущиеДанные.Sequence);

	Если Не РезультатПросмотра.ЕстьСообщения Тогда
		ПоказатьПредупреждение(, НСтр(
			"ru = 'Prompt для этого шага не сохранён.';
			|en = 'Prompt for this step was not saved.'"));
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстPrompt", РезультатПросмотра.ТекстPrompt);
	ПараметрыФормы.Вставить("СистемныйPrompt", "");
	ПараметрыФормы.Вставить("ИнструкцияPrompt", "");
	ПараметрыФормы.Вставить("ИмяМодели", РезультатПросмотра.ИмяМодели);
	// UI-11: показываем фактический массив messages LLM-вызова — вкладки
	// «Системный»/«Инструкция» (сборка prompt агента, UI-03) здесь неприменимы.
	ПараметрыФормы.Вставить("СкрытьСистемныйИИнструкцию", Истина);

	ЗаголовокОкна = СтрШаблон(
		НСтр("ru = 'Prompt запуска %1, шаг %2'; en = 'Prompt for run %1, step %2'"),
		RunId, Формат(ТекущиеДанные.Sequence, "ЧГ=0; ЧДЦ=0"));
	ПараметрыФормы.Вставить("ЗаголовокФормы", ЗаголовокОкна);

	// ОткрытьФормуМодально запрещён при работе без модальности (веб-клиент):
	// "Using modal windows is not allowed in this mode!". Возвращаемое значение
	// формы здесь не используется - это просмотр prompt, поэтому достаточно
	// обычного ОткрытьФорму с блокировкой окна владельца.
	ОткрытьФорму("ОбщаяФорма.ar_ФормаПросмотраPrompt", ПараметрыФормы, ЭтотОбъект,
		, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// UI-13: возобновление Interrupted-запуска вручную из Run Viewer.
//
// 1. Клиентский диалог подтверждения (ВопросАсинх, Да/Нет) — предупреждает
//    оператора о риске повторного выполнения мутирующих действий (Plan §3.1).
// 2. При подтверждении — кнопка временно недоступна (защита от повторного
//    клика, UC-3), серверный вызов ar_RuntimeЗапуск.Возобновить(RunId)
//    (через ВозобновитьНаСервере).
// 3. Результат обрабатывается по 4 веткам (UC-1..4 спеки UI-13):
//     * Успех = Истина                          — UC-1, шапка перечитывается,
//       кнопка скрывается (статус более не Interrupted).
//     * Причина = "snapshot_missing_or_incompatible" — UC-2, информативное
//       сообщение, кнопка остаётся видимой/доступной.
//     * Причина = "already_running"             — UC-3, шапка перечитывается
//       (кнопка скроется сама, если статус сменился).
//     * Причина = "unexpected_status: ..." / "run_not_found" — UC-4 и граничный
//       случай, шапка перечитывается.
//
// Параметры:
//   Команда - КомандаФормы - команда формы ar_Возобновить (параметры не используются).
//
&НаКлиенте
Асинх Процедура ar_Возобновить(Команда)

	ТекстВопроса = НСтр(
		"ru = 'Возобновить прерванный запуск?
		|Если запуск был прерван во время выполнения шага, повторный запуск
		|может привести к повторному выполнению уже начатых мутирующих действий.
		|Продолжить?';
		|en = 'Resume the interrupted run?
		|If the run was interrupted during a step, resuming may cause already
		|started mutating actions to run again.
		|Continue?'");

	Ответ = Ждать ВопросАсинх(
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		,
		КодВозвратаДиалога.Нет,
		НСтр("ru = 'Возобновление запуска'; en = 'Resume run'"));

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	// UC-3 (граничный случай «двойной клик»): отключаем кнопку на время
	// серверного вызова, включаем обратно только если запуск не возобновился.
	Элементы.КнопкаВозобновить.Доступность = Ложь;

	Результат = ВозобновитьНаСервере();

	// В обоих случаях статус мог измениться (UC-1: Interrupted → Running;
	// UC-3: уже Running) — перечитываем шапку/видимость кнопки (ЗаполнитьШапку,
	// см. ПрочитатьШапкуЗапуска/ЗаполнитьШапку, UI-10/UI-12). Делаем это до
	// разбора Результат.Успех — ОбновитьШапкуПослеResumeНаСервере сама скрывает
	// кнопку, если статус более не Interrupted.
	ОбновитьШапкуПослеResumeНаСервере();

	Если Результат.Успех Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Запуск возобновлён'; en = 'Run resumed'"));

		// UI-12 (опционально по спеке UI-13, п. UC-1): при успешном resume статус
		// сменился на Running (нефинальный) — ОбновитьШапкуПослеResumeНаСервере
		// (через ЗаполнитьШапку) пересчитала ШапкаHeartbeatАктивен в Истина,
		// переподключаем таймер автообновления индикатора без перезакрытия формы.
		// Двойное подключение не возникает: кнопка скрыта после успешного resume,
		// повторный вызов ar_Возобновить невозможен.
		Если ШапкаHeartbeatАктивен Тогда
			ПодключитьОбработчикОжидания("ОбновитьHeartbeat", ИнтервалHeartbeatСек(), Ложь);
		КонецЕсли;
	Иначе
		// CONS-05: сопоставление кода причины и локализованного текста вынесено
		// в ar_Утилиты.ТекстПричиныОтказаResume - та же логика нужна форме
		// ar_КонсольАгентов, дублировать текст в двух формах запрещено правилом
		// проекта (см. .docs/specs/CONS-05.md, раздел "Риски").
		ТекстСообщения = ar_Утилиты.ТекстПричиныОтказаResume(Результат.Причина);
		Ждать ПредупреждениеАсинх(ТекстСообщения);

		// Кнопка осталась видимой (статус не изменился) — возвращаем доступность,
		// снятую перед серверным вызовом. При успехе кнопка скрыта
		// ОбновитьШапкуПослеResumeНаСервере, восстанавливать Доступность не нужно.
		Элементы.КнопкаВозобновить.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

// UI-13: серверный вызов ar_RuntimeЗапуск.Возобновить(RunId). RunId — реквизит
// формы (заполняется в ОпределитьRunIdИзПараметров), отдельных параметров нет.
//
// Привилегированный режим не используется — вызов идёт в уже привилегированные
// модули ar_RuntimeЗапуск → ar_AuditЗапуски (RT-02/RT-03, см. «Граничные случаи»
// спеки UI-13).
//
// Возвращаемое значение:
//   Структура - {Успех: Булево, RunId: Строка, Причина: Строка}, см.
//   ar_RuntimeЗапуск.Возобновить. Успех = Ложь и Причина = "internal_error: ..."
//   при непредвиденном исключении на сервере.
//
&НаСервере
Функция ВозобновитьНаСервере()

	Попытка
		Результат = ar_RuntimeЗапуск.Возобновить(RunId);
	Исключение
		// Непредвиденная серверная ошибка (например, недоступность БД) —
		// не пробрасываем исключение на клиент, возвращаем как unexpected-результат
		// (UC-4 ветка ТекстРезультатаResume обработает по умолчанию).
		Результат = Новый Структура;
		Результат.Вставить("Успех", Ложь);
		Результат.Вставить("RunId", RunId);
		Результат.Вставить("Причина", "internal_error: " + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;

	// D10: фиксируем audit-событие ручного резюме при успехе. Ошибка записи
	// события не пробрасывается (ar_AuditСобытия.Зафиксировать не выбрасывает
	// исключений) — Результат успешного resume не зависит от этого вызова.
	Если Результат.Успех Тогда
		ПолезнаяНагрузка = Новый Структура;
		ПолезнаяНагрузка.Вставить("initiated_by", "ui");
		ar_AuditЗащищённыйРежим.ЗаписатьСобытиеПривилегированно(RunId, "run_resumed_manually", ПолезнаяНагрузка);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// UI-13: перечитывает шапку запуска после resume (успешного или нет) — статус
// мог измениться (UC-1: Interrupted → Running; UC-3: возможно уже Running).
// Переиспользует ПрочитатьШапкуЗапуска/ЗаполнитьШапку (UI-10/UI-12, без изменения
// интерфейса) — ЗаполнитьШапку пересчитывает ШапкаHeartbeatАктивен, а видимость
// КнопкаВозобновить (видна только для Interrupted) пересчитывается здесь же,
// дополнительно (см. комментарий ниже).
//
// Параметры: нет (RunId — реквизит формы).
//
&НаСервере
Процедура ОбновитьШапкуПослеResumeНаСервере()

	Шапка = ПрочитатьШапкуЗапуска(RunId);
	Если Шапка = Неопределено Тогда
		// Запись удалена между вызовами (крайне редкий граничный случай) —
		// оставляем форму как есть, отдельный режим заглушки не требуется
		// (ПоказатьПредупреждение про run_not_found уже показан выше).
		Возврат;
	КонецЕсли;

	ЗаполнитьШапку(Шапка);

	// ЗаполнитьШапку не трогает видимость КнопкаВозобновить (это делает только
	// ПриСозданииНаСервере) — пересчитываем здесь по тому же правилу UI-10.
	Элементы.КнопкаВозобновить.Видимость =
		(Шапка.Статус = Перечисления.ar_СтатусЗапуска.Interrupted);

КонецПроцедуры

// CONS-06 (D4): подтвердить действие из очереди approval ПО ТЕКУЩЕЙ СТРОКЕ карточки
// запуска, без перехода в ОбщаяФорма.ar_ОчередьПодтверждений. Решение принимает
// готовый ar_Approval.Принять - логика approve/исполнения (шаги 1-5 внутри) не
// дублируется, здесь только чтение текущей строки и разбор результата по образцу
// ВыполнитьApprove из ar_ОчередьПодтверждений (три ветки: успех+выполнено /
// успех-не выполнено / неуспех).
//
// Параметры:
//   Команда - КомандаФормы - команда формы ar_ПодтвердитьApproval (не используется).
//
&НаКлиенте
Асинх Процедура ar_ПодтвердитьApproval(Команда)

	ТекущиеДанные = Элементы.ОжидаетПодтверждения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.ЭтоИстория Тогда
		// Защитная проверка: команда для решённых записей недоступна
		// (ОбновитьДоступностьКнопокApproval), но могла быть вызвана иначе
		// (например, с клавиатуры) - см. аналогичную защиту в ar_ПоказатьPrompt.
		Возврат;
	КонецЕсли;

	Результат = ПринятьApprovalНаСервере(ТекущиеДанные.ApprovalId);

	Если Результат.Успех Тогда
		Если Результат.ДействиеВыполнено Тогда
			ТекстУспеха = НСтр("ru = 'Принято'; en = 'Approved'");
			Если Результат.ДокументСсылка = Неопределено Тогда
				ПояснениеУспеха = НСтр("ru = 'Действие выполнено'; en = 'Action executed'");
			Иначе
				ПояснениеУспеха = СтрШаблон(
					НСтр("ru = 'Создан объект: %1'; en = 'Object created: %1'"),
					Строка(Результат.ДокументСсылка));
			КонецЕсли;
			ПоказатьОповещениеПользователя(ТекстУспеха, , ПояснениеУспеха);
		Иначе
			Если ПустаяСтрока(Результат.ДействиеСообщение) Тогда
				ПричинаНевыполнения = НСтр("ru = 'причина не указана'; en = 'no reason given'");
			Иначе
				ПричинаНевыполнения = Результат.ДействиеСообщение;
			КонецЕсли;
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Решение принято, но действие не выполнено: %1
					|
					|Подробности - в служебном логе (ar_ПоказатьЛог).';
					|en = 'Decision recorded, but the action was not executed: %1
					|
					|See the service log (ar_ПоказатьЛог) for details.'"),
				ПричинаНевыполнения);
			Ждать ПредупреждениеАсинх(ТекстПредупреждения);
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось принять действие: %1'; en = 'Failed to approve action: %1'"),
			Результат.Причина);
		Ждать ПредупреждениеАсинх(ТекстОшибки);
	КонецЕсли;

	ЗаполнитьОжидаетПодтвержденияНаСервере();
	ОбновитьДоступностьКнопокApproval();

КонецПроцедуры

// CONS-06 (D4): отклонить действие из очереди approval ПО ТЕКУЩЕЙ СТРОКЕ карточки.
// Причина отказа читается из штатного реквизита формы ПричинаОтказаApproval (поле
// ввода рядом с кнопками) - НЕ из DOM, в отличие от ar_ОчередьПодтверждений (там
// причина читается из HTML-поля, здесь секция построена на штатных элементах
// формы, см. риск «двойное определение поля причины» в .docs/specs/CONS-06.md).
//
// Параметры:
//   Команда - КомандаФормы - команда формы ar_ОтклонитьApproval (не используется).
//
&НаКлиенте
Асинх Процедура ar_ОтклонитьApproval(Команда)

	ТекущиеДанные = Элементы.ОжидаетПодтверждения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.ЭтоИстория Тогда
		Возврат;
	КонецЕсли;

	Результат = ОтклонитьApprovalНаСервере(ТекущиеДанные.ApprovalId, ПричинаОтказаApproval);

	Если Результат.Успех Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Отклонено'; en = 'Rejected'"));
		ПричинаОтказаApproval = "";
	Иначе
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось отклонить действие: %1'; en = 'Failed to reject action: %1'"),
			Результат.Причина);
		Ждать ПредупреждениеАсинх(ТекстОшибки);
	КонецЕсли;

	ЗаполнитьОжидаетПодтвержденияНаСервере();
	ОбновитьДоступностьКнопокApproval();

КонецПроцедуры

// CONS-06: пересчитывает доступность командной панели секции «Ожидает
// подтверждения» - для решённых записей (ЭтоИстория = Истина) кнопки
// «Подтвердить»/«Отклонить» недоступны (D4), для пустой выборки (нет текущей
// строки) - тоже недоступны.
//
&НаКлиенте
Процедура ОбновитьДоступностьКнопокApproval()

	ТекущиеДанные = Элементы.ОжидаетПодтверждения.ТекущиеДанные;
	ДоступноРешение = (ТекущиеДанные <> Неопределено) И (Не ТекущиеДанные.ЭтоИстория);

	Элементы.КнопкаПодтвердитьApproval.Доступность = ДоступноРешение;
	Элементы.КнопкаОтклонитьApproval.Доступность = ДоступноРешение;
	Элементы.ПричинаОтказаApproval.Доступность = ДоступноРешение;

КонецПроцедуры

&НаСервере
Функция ПринятьApprovalНаСервере(Знач ApprovalId)
	Возврат ar_Approval.Принять(ApprovalId, Пользователи.ТекущийПользователь());
КонецФункции

&НаСервере
Функция ОтклонитьApprovalНаСервере(Знач ApprovalId, Знач Причина)
	Возврат ar_Approval.Отклонить(ApprovalId, Пользователи.ТекущийПользователь(), Причина);
КонецФункции

&НаСервере
Процедура ЗаполнитьОжидаетПодтвержденияНаСервере()
	ЗаполнитьОжидаетПодтверждения(RunId);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОпределитьRunIdИзПараметров()

	Значение = "";
	Если Параметры.Свойство("RunId", Значение) И ТипЗнч(Значение) = Тип("Строка")
		И НЕ ПустаяСтрока(Значение) Тогда
		Возврат СокрЛП(Значение);
	КонецЕсли;

	// Альтернативное открытие из динамического списка — по ключу записи регистра.
	Ключ = Неопределено;
	Если Параметры.Свойство("Ключ", Ключ)
		И ТипЗнч(Ключ) = Тип("РегистрСведенийКлючЗаписи.ar_Запуски") Тогда
		Возврат СокрЛП(Ключ.ar_RunId);
	КонецЕсли;

	Возврат "";

КонецФункции

// Читает шапку запуска через менеджер записи регистра ar_Запуски.
// Привилегированный режим не используется — доступ регулируется ролями.
//
// Возвращаемое значение:
//   Структура - поля шапки запуска; Неопределено, если запись не найдена.
//
&НаСервере
Функция ПрочитатьШапкуЗапуска(Знач ЗначениеRunId)

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_RunId = ЗначениеRunId;
	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Статус", МенеджерЗаписи.ar_Статус);
	Результат.Вставить("Агент", МенеджерЗаписи.ar_АгентРеф);
	Результат.Вставить("СтартовалВ", МенеджерЗаписи.ar_СтартовалВ);
	Результат.Вставить("ЗавершенВ", МенеджерЗаписи.ar_ЗавершенВ);
	Результат.Вставить("Триггер", МенеджерЗаписи.ar_Триггер);
	Результат.Вставить("Пользователь", МенеджерЗаписи.ar_ПользовательРеф);
	Результат.Вставить("ТокеновВход", МенеджерЗаписи.ar_ТокеновВход);
	Результат.Вставить("ТокеновВыход", МенеджерЗаписи.ar_ТокеновВыход);
	Результат.Вставить("СтоимостьРуб", МенеджерЗаписи.ar_СтоимостьРуб);
	Результат.Вставить("ШаговВсего", МенеджерЗаписи.ar_ШаговВсего);
	Результат.Вставить("РодительскийRunId", МенеджерЗаписи.ar_РодительскийRunId);
	Результат.Вставить("LastHeartbeat", МенеджерЗаписи.ar_LastHeartbeat);
	Результат.Вставить("ЕстьСнимок", ЗначениеЗаполнено(МенеджерЗаписи.ar_StateSnapshot));

	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьШапку(Знач Шапка)

	ЗначениеПрочерк = Прочерк();

	ШапкаСтатус = Строка(Шапка.Статус);
	ШапкаАгент = ?(ЗначениеЗаполнено(Шапка.Агент), Строка(Шапка.Агент), ЗначениеПрочерк);
	ШапкаТриггер = ?(ПустаяСтрока(Шапка.Триггер), ЗначениеПрочерк, Шапка.Триггер);
	ШапкаПользователь = ?(ЗначениеЗаполнено(Шапка.Пользователь), Строка(Шапка.Пользователь), ЗначениеПрочерк);

	ШапкаТокены = СтрШаблон("%1 / %2",
		ЦелоеСтрокой(Шапка.ТокеновВход),
		ЦелоеСтрокой(Шапка.ТокеновВыход));
	ШапкаСтоимость = Формат(Шапка.СтоимостьРуб, "ЧДЦ=2");
	ШапкаШагов = ЦелоеСтрокой(Шапка.ШаговВсего);
	ШапкаДлительность = ПредставлениеДлительности(Шапка.СтартовалВ, Шапка.ЗавершенВ);

	// Детали для узла «Запуск».
	ДетальЗапускRunId = RunId;
	ДетальЗапускРодитель = ?(ПустаяСтрока(Шапка.РодительскийRunId), ЗначениеПрочерк, Шапка.РодительскийRunId);

	// UI-12: «Heartbeat: N сек назад» вместо сырой даты. ШапкаLastHeartbeat
	// сохраняется в реквизит формы — клиентский таймер (ОбновитьHeartbeat)
	// пересчитывает текст без повторного серверного запроса (вариант A).
	ШапкаLastHeartbeat = Шапка.LastHeartbeat;
	Элементы.ДекорацияHeartbeat.Заголовок = ПредставлениеHeartbeat(
		Шапка.LastHeartbeat, ТекущаяДатаСеанса());

	// Автообновление подключается (см. ПриОткрытии) только если LastHeartbeat
	// заполнен и статус запуска не финальный — для финальных статусов растущий
	// «N сек назад» был бы бессмысленным «мусорным» счётчиком (см. D4 спеки
	// UI-12): значение фиксируется один раз на момент открытия формы.
	ШапкаHeartbeatАктивен = ЗначениеЗаполнено(Шапка.LastHeartbeat)
		И НЕ СтатусФинальный(Шапка.Статус);

	// UI-13 (косвенно): индикатор наличия снимка состояния для будущего «Возобновить».
	Если Шапка.ЕстьСнимок Тогда
		Элементы.ДекорацияЕстьСнимок.Заголовок = НСтр(
			"ru = 'Снимок состояния: да'; en = 'State snapshot: yes'");
	Иначе
		Элементы.ДекорацияЕстьСнимок.Заголовок = НСтр(
			"ru = 'Снимок состояния: нет'; en = 'State snapshot: no'");
	КонецЕсли;

КонецПроцедуры

// Строит дерево «Запуск → шаги»: корневой узел — запуск, дочерние — слитый
// по ar_Sequence список событий и tool calls. Переносит ДеревоЗначений в
// реквизит формы через БСП [Реф: БСП/ОбщегоНазначения].
//
&НаСервере
Процедура ПостроитьДерево(Знач ЗначениеRunId)

	ДеревоЗначений = ШагиЗапускаДеревом(ЗначениеRunId);

	КоллекцияЭлементовДерева = ДеревоШагов.ПолучитьЭлементы();
	КоллекцияЭлементовДерева.Очистить();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(
		КоллекцияЭлементовДерева, ДеревоЗначений);

	// Развернуть корневой узел запуска (он один). Элементы.ДеревоШагов.Развернуть -
	// клиентский метод (управление визуальным состоянием дерева), недоступен на
	// сервере ("Method not available on server") - фактическое разворачивание
	// выполняется в клиентском ПриОткрытии.

КонецПроцедуры

// Формирует ДеревоЗначений со структурой колонок, совпадающей с колонками
// реквизита формы ДеревоШагов (Представление, Тип, Время, Sequence, RiskLevel).
//
&НаСервере
Функция ШагиЗапускаДеревом(Знач ЗначениеRunId)

	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Представление");
	Дерево.Колонки.Добавить("Тип");
	Дерево.Колонки.Добавить("Время");
	Дерево.Колонки.Добавить("Sequence");
	Дерево.Колонки.Добавить("RiskLevel");
	// UI-11: машиночитаемое имя типа события (для определения LLMCalled на клиенте
	// без парсинга Представление, см. ДеревоШаговПриАктивизацииСтроки).
	Дерево.Колонки.Добавить("ТипСобытияИмя");

	КореньЗапуск = Дерево.Строки.Добавить();
	КореньЗапуск.Представление = СтрШаблон(
		НСтр("ru = 'Запуск %1'; en = 'Run %1'"), ЗначениеRunId);
	КореньЗапуск.Тип = "Запуск";
	КореньЗапуск.Sequence = 0;

	Шаги = ВыбратьШаги(ЗначениеRunId);

	Для Каждого Шаг Из Шаги Цикл
		СтрокаШага = КореньЗапуск.Строки.Добавить();
		СтрокаШага.Тип = Шаг.Тип;
		СтрокаШага.Sequence = Шаг.Sequence;
		СтрокаШага.Время = ?(ЗначениеЗаполнено(Шаг.Время), Формат(Шаг.Время, "ДЛФ=DT"), "");
		Если Шаг.Тип = "Событие" Тогда
			СтрокаШага.Представление = СтрШаблон("[%1] %2", ЦелоеСтрокой(Шаг.Sequence),
				Строка(Шаг.ТипСобытия));
			СтрокаШага.ТипСобытияИмя = Строка(Шаг.ТипСобытия);
		Иначе
			СтрокаШага.Представление = СтрШаблон("[%1] tool: %2",
				ЦелоеСтрокой(Шаг.Sequence), Шаг.ИмяTool);
			СтрокаШага.RiskLevel = Строка(Шаг.RiskLevel);
		КонецЕсли;
	КонецЦикла;

	Возврат Дерево;

КонецФункции

// Выбирает события и tool calls по RunId, объединяет в одну таблицу и
// сортирует по ar_Sequence (общий хронологический порядок).
//
&НаСервере
Функция ВыбратьШаги(Знач ЗначениеRunId)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RunId", ЗначениеRunId);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	""Событие"" КАК Тип,
	|	События.ar_Sequence КАК Sequence,
	|	События.ar_МоментВремени КАК Время,
	|	События.ar_ТипСобытия КАК ТипСобытия,
	|	"""" КАК ИмяTool,
	|	ЗНАЧЕНИЕ(Перечисление.ar_RiskLevel.ПустаяСсылка) КАК RiskLevel
	|ИЗ
	|	РегистрСведений.ar_СобытияЗапуска КАК События
	|ГДЕ
	|	События.ar_RunId = &RunId
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ToolCall"",
	|	Действия.ar_Sequence,
	|	NULL,
	|	ЗНАЧЕНИЕ(Перечисление.ar_ТипСобытия.ПустаяСсылка),
	|	Действия.ar_ИмяTool,
	|	Действия.ar_RiskLevel
	|ИЗ
	|	РегистрСведений.ar_ДействияАгента КАК Действия
	|ГДЕ
	|	Действия.ar_RunId = &RunId
	|
	|УПОРЯДОЧИТЬ ПО
	|	Sequence,
	|	Тип";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// CONS-06 (D1): заполняет секцию «Созданные объекты 1С» - все непустые
// ar_ResultRef запуска, отдельным целевым запросом к ar_ДействияАгента (не
// выборкой из уже построенного ДеревоШагов - там представление урезано под
// нужды дерева, см. .docs/specs/CONS-06.md, «Поведение», п.1).
//
// Время строки - момент связанного события ToolCall с тем же RunId+Sequence
// (ar_СобытияЗапуска.ar_МоментВремени, ЛЕВОЕ СОЕДИНЕНИЕ - тот же источник
// времени, что ВыбратьШаги использует для дерева); если события нет - прочерк.
//
// Параметры:
//   ЗначениеRunId - Строка - идентификатор запуска.
//
&НаСервере
Процедура ЗаполнитьСозданныеОбъекты(Знач ЗначениеRunId)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RunId", ЗначениеRunId);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Действия.ar_ИмяTool КАК ИмяTool,
	|	Действия.ar_ResultRef КАК ResultRef,
	|	События.ar_МоментВремени КАК МоментВремени
	|ИЗ
	|	РегистрСведений.ar_ДействияАгента КАК Действия
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ar_СобытияЗапуска КАК События
	|		ПО Действия.ar_RunId = События.ar_RunId
	|			И Действия.ar_Sequence = События.ar_Sequence
	|ГДЕ
	|	Действия.ar_RunId = &RunId
	|	И Действия.ar_ResultRef <> """"
	|УПОРЯДОЧИТЬ ПО
	|	Действия.ar_Sequence";

	СозданныеОбъекты.Очистить();

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		НавигационнаяСсылка = "" + Выборка.ResultRef;
		Объект = ar_Утилиты.ОбъектИзНавигационнойСсылки(НавигационнаяСсылка);

		НоваяСтрока = СозданныеОбъекты.Добавить();
		НоваяСтрока.Представление = ar_ApprovalПредставление.ПредставлениеTool(Выборка.ИмяTool);
		// D5 (CONS-06)/fallback ROREF: не разыменованная ссылка показывается как
		// исходный текст - тот же паттерн, что ПолеToolResultRefНажатие (строки 231-237).
		НоваяСтрока.ОбъектТекст = ?(Объект <> Неопределено, Строка(Объект), НавигационнаяСсылка);
		НоваяСтрока.НавигационнаяСсылка = ?(Объект <> Неопределено, НавигационнаяСсылка, "");
		НоваяСтрока.Время = ?(ЗначениеЗаполнено(Выборка.МоментВремени),
			Формат(Выборка.МоментВремени, "ДЛФ=DT"), Прочерк());

	КонецЦикла;

	// Секция пустая - таблица скрывается, показывается заглушка (тот же паттерн,
	// что для «Ожидает подтверждения», см. ЗаполнитьОжидаетПодтверждения).
	ЕстьСтроки = (СозданныеОбъекты.Количество() > 0);
	Элементы.СозданныеОбъекты.Видимость = ЕстьСтроки;
	Элементы.ДекорацияНетСозданныхОбъектов.Видимость = Не ЕстьСтроки;

КонецПроцедуры

// CONS-06 (D3): заполняет секцию «Ожидает подтверждения» - pending-записи
// ar_ОчередьApproval этого RunId плюс терминальные записи (историю) того же
// RunId в ОДНОЙ таблице с булевым признаком ЭтоИстория (см. .docs/specs/CONS-06.md,
// «Поведение», п.1 - выбранный вариант архитектуры).
//
// Каждая строка строится через ar_ApprovalПредставление.СобратьКарточку -
// единственный источник разбора payload (Представление/Риск/Обоснование/Эффект),
// свой парсер JSON не пишется (см. риск «БейджРиска - HTML» - здесь НЕ
// используется, вместо неё Карточка.Риск - обычная строка + условное оформление
// в Form.xml по значению этой колонки).
//
// SEC-02: Обоснование/ЭффектТекст маскируются от секретов перед показом на форме
// (двойная защита - основное маскирование уже в ar_Approval.Отклонить при записи
// причины оператора, здесь - на пути показа LLM-обоснования постановки).
//
// Параметры:
//   ЗначениеRunId - Строка - идентификатор запуска.
//
&НаСервере
Процедура ЗаполнитьОжидаетПодтверждения(Знач ЗначениеRunId)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RunId", ЗначениеRunId);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Очередь.ar_ApprovalId КАК ApprovalId,
	|	Очередь.ar_ActionPayloadJSON КАК PayloadJSON,
	|	Очередь.ar_Статус КАК Статус,
	|	Очередь.ar_ОбоснованиеLLM КАК ОбоснованиеLLM,
	|	Очередь.ar_СозданоВ КАК СозданоВ,
	|	Очередь.ar_РешеноВ КАК РешеноВ,
	|	Очередь.ar_РешилПользователь КАК РешилПользователь
	|ИЗ
	|	РегистрСведений.ar_ОчередьApproval КАК Очередь
	|ГДЕ
	|	Очередь.ar_RunId = &RunId
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ar_СозданоВ";

	ОжидаетПодтверждения.Очистить();

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ЭтоИстория = (Выборка.Статус <> "pending");
		Карточка = ar_ApprovalПредставление.СобратьКарточку("" + Выборка.ApprovalId, "" + Выборка.PayloadJSON);

		// Для pending - Карточка.Обоснование (rationale LLM из payload постановки).
		// Для решённых записей ar_ОбоснованиеLLM регистра уже переписан итогом
		// решения (ar_Approval.Отклонить пишет туда причину оператора, Принять -
		// итог исполнения через ПометитьApprovalВыполненным) - показываем
		// актуальное значение поля, а не исходный rationale из payload.
		ТекстОбоснования = ?(ЭтоИстория, "" + Выборка.ОбоснованиеLLM, Карточка.Обоснование);

		НоваяСтрока = ОжидаетПодтверждения.Добавить();
		НоваяСтрока.ApprovalId = "" + Выборка.ApprovalId;
		НоваяСтрока.Представление = Карточка.Представление;
		НоваяСтрока.ЭффектТекст = ar_Утилиты.МаскироватьСекреты(Карточка.Эффект);
		НоваяСтрока.Риск = Карточка.Риск;
		НоваяСтрока.Обоснование = ar_Утилиты.МаскироватьСекреты(ТекстОбоснования);
		НоваяСтрока.СозданоВТекст = ?(ЗначениеЗаполнено(Выборка.СозданоВ),
			Формат(Выборка.СозданоВ, "ДЛФ=DT"), Прочерк());
		НоваяСтрока.ЭтоИстория = ЭтоИстория;
		НоваяСтрока.СтатусТекст = "" + Выборка.Статус;

		Если ЭтоИстория Тогда
			НоваяСтрока.РешилТекст = ?(ЗначениеЗаполнено(Выборка.РешилПользователь),
				Строка(Выборка.РешилПользователь), Прочерк());
			НоваяСтрока.РешеноВТекст = ?(ЗначениеЗаполнено(Выборка.РешеноВ),
				Формат(Выборка.РешеноВ, "ДЛФ=DT"), Прочерк());
		Иначе
			НоваяСтрока.РешилТекст = Прочерк();
			НоваяСтрока.РешеноВТекст = Прочерк();
		КонецЕсли;

	КонецЦикла;

	ЕстьСтроки = (ОжидаетПодтверждения.Количество() > 0);
	Элементы.ОжидаетПодтверждения.Видимость = ЕстьСтроки;
	Элементы.ДекорацияНетApproval.Видимость = Не ЕстьСтроки;

КонецПроцедуры

// Заполняет боковую панель деталей для выбранного узла дерева.
//
&НаСервере
Процедура ОбновитьДеталиУзлаНаСервере(Знач ИдентификаторСтроки)

	СтрокаДерева = ДеревоШагов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтрокаДерева = Неопределено Тогда
		Элементы.ГруппаДетали.ТекущаяСтраница = Элементы.СтраницаДеталиПусто;
		Возврат;
	КонецЕсли;

	Если СтрокаДерева.Тип = "Запуск" Тогда
		Элементы.ГруппаДетали.ТекущаяСтраница = Элементы.СтраницаДеталиЗапуск;
	ИначеЕсли СтрокаДерева.Тип = "Событие" Тогда
		ЗаполнитьДеталиСобытия(СтрокаДерева.Sequence);
		Элементы.ГруппаДетали.ТекущаяСтраница = Элементы.СтраницаДеталиСобытие;
	Иначе
		ЗаполнитьДеталиToolCall(СтрокаДерева.Sequence);
		Элементы.ГруппаДетали.ТекущаяСтраница = Элементы.СтраницаДеталиToolCall;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеталиСобытия(Знач Sequence)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RunId", RunId);
	Запрос.УстановитьПараметр("Sequence", Sequence);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	События.ar_ТипСобытия КАК ТипСобытия,
	|	События.ar_МоментВремени КАК МоментВремени,
	|	События.ar_PayloadJSON КАК PayloadJSON
	|ИЗ
	|	РегистрСведений.ar_СобытияЗапуска КАК События
	|ГДЕ
	|	События.ar_RunId = &RunId
	|	И События.ar_Sequence = &Sequence";

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ДетальСобытиеТип = Строка(Выборка.ТипСобытия);
	ДетальСобытиеВремя = ?(ЗначениеЗаполнено(Выборка.МоментВремени),
		Формат(Выборка.МоментВремени, "ДЛФ=DT"), "");
	// SEC-02: payload очищается при записи (ar_AuditСобытия.ОчиститьЧувствительныеКлючи),
	// дополнительно маскируем секреты при отображении как двойную защиту.
	ДетальСобытиеPayload = ar_Утилиты.МаскироватьСекреты(Выборка.PayloadJSON);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеталиToolCall(Знач Sequence)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RunId", RunId);
	Запрос.УстановитьПараметр("Sequence", Sequence);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Действия.ar_ИмяTool КАК ИмяTool,
	|	Действия.ar_АргументыJSON КАК АргументыJSON,
	|	Действия.ar_RiskLevel КАК RiskLevel,
	|	Действия.ar_ResultRef КАК ResultRef,
	|	Действия.ar_ApprovedBy КАК ApprovedBy,
	|	Действия.ar_ApprovedAt КАК ApprovedAt,
	|	Действия.ar_ДлительностьМС КАК ДлительностьМС
	|ИЗ
	|	РегистрСведений.ar_ДействияАгента КАК Действия
	|ГДЕ
	|	Действия.ar_RunId = &RunId
	|	И Действия.ar_Sequence = &Sequence";

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ДетальToolИмя = Выборка.ИмяTool;
	ДетальToolRiskLevel = Строка(Выборка.RiskLevel);
	ДетальToolАргументы = ar_Утилиты.МаскироватьСекреты(Выборка.АргументыJSON);
	ДетальToolResultRef = Выборка.ResultRef;
	ДетальToolApprovedBy = ?(ЗначениеЗаполнено(Выборка.ApprovedBy), Строка(Выборка.ApprovedBy), Прочерк());
	ДетальToolApprovedAt = ?(ЗначениеЗаполнено(Выборка.ApprovedAt),
		Формат(Выборка.ApprovedAt, "ДЛФ=DT"), Прочерк());
	// PERF-04: 0 означает "не измерено" - показываем прочерк, а не "0".
	ДетальToolДлительностьМС = ПредставлениеДлительностиМС(Выборка.ДлительностьМС);

КонецПроцедуры

// PERF-04: текстовое представление ar_ДлительностьМС для боковой панели деталей
// tool call - 0 ("не измерено", см. Comment ресурса регистра ar_ДействияАгента)
// показывается прочерком, а не нулём, чтобы не создавать впечатление
// мгновенного выполнения.
//
// Параметры:
//   ДлительностьМС - Число - значение ресурса ar_ДлительностьМС (>= 0).
//
// Возвращаемое значение:
//   Строка - целое число без разделителей групп либо Прочерк() для 0.
//
&НаСервереБезКонтекста
Функция ПредставлениеДлительностиМС(Знач ДлительностьМС)

	Число = ?(ТипЗнч(ДлительностьМС) = Тип("Число"), ДлительностьМС, 0);
	Если Число <= 0 Тогда
		Возврат Прочерк();
	КонецЕсли;

	Возврат ЦелоеСтрокой(Число);

КонецФункции

&НаСервере
Функция ОбъектИзНавигационнойСсылкиНаСервере(Знач НавигационнаяСсылка)
	Возврат ar_Утилиты.ОбъектИзНавигационнойСсылки(НавигационнаяСсылка);
КонецФункции

// UI-11: читает массив messages из payload события LLMCalled для шага Sequence.
//
// В отличие от ЗаполнитьДеталиСобытия (боковая панель, усечение 500 символов
// через ar_Утилиты.МаскироватьСекреты), здесь читается ПОЛНЫЙ ar_PayloadJSON —
// маскирование секретов уже выполнено при записи события
// (ar_AuditСобытия.БезопасноЗамаскироватьСтроку, SEC-02), повторное
// маскирование с обрезкой не требуется и испортило бы «полный prompt».
//
// ar_JSON.ИзJSON не выбрасывает исключений при некорректном JSON (возвращает
// Неопределено) — дополнительная обработка Попытка/Исключение не требуется,
// результат уже проверяется ТипЗнч(Payload) <> Тип("Соответствие") ниже.
//
// Параметры:
//   Sequence - Число - порядковый номер шага (РегистрСведений.ar_СобытияЗапуска.ar_Sequence)
//              в рамках текущего RunId (реквизит формы).
//
// Возвращаемое значение:
//   Массив, Неопределено - массив сообщений messages (если событие LLMCalled
//   с непустым ключом "messages" найдено), иначе Неопределено.
//
&НаСервере
Функция ПрочитатьСообщенияLLMCalled(Знач Sequence)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RunId", RunId);
	Запрос.УстановитьПараметр("Sequence", Sequence);
	Запрос.УстановитьПараметр("ТипСобытия", Перечисления.ar_ТипСобытия.LLMCalled);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	События.ar_PayloadJSON КАК PayloadJSON
	|ИЗ
	|	РегистрСведений.ar_СобытияЗапуска КАК События
	|ГДЕ
	|	События.ar_RunId = &RunId
	|	И События.ar_Sequence = &Sequence
	|	И События.ar_ТипСобытия = &ТипСобытия";

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Payload = ar_JSON.ИзJSON(Выборка.PayloadJSON);
	Если ТипЗнч(Payload) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Сообщения = Payload.Получить("messages");
	Если ТипЗнч(Сообщения) <> Тип("Массив") Или Сообщения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Сообщения;

КонецФункции

// UI-11: дешёвая проверка для ОбновитьВидимостьКнопкиPrompt — есть ли непустой
// messages в payload события LLMCalled для данного шага.
//
// Параметры:
//   Sequence - Число - порядковый номер шага (РегистрСведений.ar_СобытияЗапуска.ar_Sequence)
//              в рамках текущего RunId (реквизит формы).
//
// Возвращаемое значение:
//   Булево - Истина, если для шага найдено событие LLMCalled с непустым messages.
//
&НаСервере
Функция ЕстьСообщенияPromptДляУзлаНаСервере(Знач Sequence)
	Возврат ПрочитатьСообщенияLLMCalled(Sequence) <> Неопределено;
КонецФункции

// UI-11: возвращает данные для модального просмотра prompt (CommonForm.ar_ФормаПросмотраPrompt).
//
// Параметры:
//   Sequence - Число - порядковый номер шага (РегистрСведений.ar_СобытияЗапуска.ar_Sequence)
//              в рамках текущего RunId (реквизит формы).
//
// Возвращаемое значение:
//   Структура:
//     * ЕстьСообщения - Булево
//     * ТекстPrompt    - Строка - КрасивыйФорматJSON(messages), "" если нет данных.
//     * ИмяМодели      - Строка - модель агента (ar_Агенты.ar_Модель) для оценки токенов.
//
&НаСервере
Функция ПолучитьPromptДляУзлаНаСервере(Знач Sequence)

	Результат = Новый Структура;
	Результат.Вставить("ЕстьСообщения", Ложь);
	Результат.Вставить("ТекстPrompt", "");
	Результат.Вставить("ИмяМодели", "");

	Сообщения = ПрочитатьСообщенияLLMCalled(Sequence);
	Если Сообщения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.ЕстьСообщения = Истина;
	Результат.ТекстPrompt = ar_JSON.КрасивыйФорматJSON(Сообщения);
	Результат.ИмяМодели = ИмяМоделиАгентаЗапуска();

	Возврат Результат;

КонецФункции

// UI-11: имя модели агента текущего запуска (для ar_Токены.Оценить в
// CommonForm.ar_ФормаПросмотраPrompt). Пустая строка, если агент/модель не заполнены.
//
// Возвращаемое значение:
//   Строка - имя модели (ar_Агенты.ar_Модель) агента запуска, "" если не заполнено.
//
&НаСервере
Функция ИмяМоделиАгентаЗапуска()

	// Явное соединение со справочником вместо навигации через точку
	// (Запуски.ar_АгентРеф.ar_Модель) — избегаем неявного вложенного запроса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("RunId", RunId);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Агенты.ar_Модель КАК Модель
	|ИЗ
	|	РегистрСведений.ar_Запуски КАК Запуски
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ar_Агенты КАК Агенты
	|		ПО Запуски.ar_АгентРеф = Агенты.Ссылка
	|ГДЕ
	|	Запуски.ar_RunId = &RunId";

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат "";
	КонецЕсли;

	Возврат ?(ТипЗнч(Выборка.Модель) = Тип("Строка"), Выборка.Модель, "");

КонецФункции

&НаКлиенте
Процедура ОбновитьДеталиУзла(Знач ИдентификаторСтроки)
	ОбновитьДеталиУзлаНаСервере(ИдентификаторСтроки);
КонецПроцедуры

&НаСервере
Процедура ПоказатьЗаглушкуНеНайдено()
	Элементы.ДекорацияНеНайдено.Видимость = Истина;
	Элементы.ГруппаШапка.Видимость = Ложь;
	Элементы.ГруппаМастерДеталь.Видимость = Ложь;
	Заголовок = НСтр("ru = 'Просмотр запуска — запуск не найден';
		|en = 'Run viewer — run not found'");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеДлительности(Знач СтартовалВ, Знач ЗавершенВ)

	Если НЕ ЗначениеЗаполнено(СтартовалВ) Тогда
		Возврат Прочерк();
	КонецЕсли;

	Конец = ?(ЗначениеЗаполнено(ЗавершенВ), ЗавершенВ, ТекущаяДатаСеанса());
	Секунд = Цел(Конец - СтартовалВ);
	Если Секунд < 0 Тогда
		Секунд = 0;
	КонецЕсли;

	Возврат СтрШаблон(НСтр("ru = '%1 сек'; en = '%1 sec'"), ЦелоеСтрокой(Секунд));

КонецФункции

// UI-12: текст индикатора «Heartbeat: N сек назад» (или «Heartbeat: —» для
// незаполненного значения). N = Цел(Текущая - LastHeartbeat), отрицательные
// значения клиппуются в 0 — по аналогии с ПредставлениеДлительности.
//
// Используется при первом заполнении шапки (ЗаполнитьШапку, Текущая =
// ТекущаяДатаСеанса()). Для последующих тиков клиентского таймера используется
// ПредставлениеHeartbeatНаКлиенте (та же формула, клиентский контекст).
//
// Параметры:
//   LastHeartbeat - Дата - ar_LastHeartbeat запуска (РегистрСведений.ar_Запуски);
//                    Дата(1,1,1), если шагов ещё не было.
//   Текущая       - Дата - момент времени, относительно которого считается N.
//
// Возвращаемое значение:
//   Строка - локализованный текст индикатора.
//
&НаСервереБезКонтекста
Функция ПредставлениеHeartbeat(Знач LastHeartbeat, Знач Текущая)

	Если НЕ ЗначениеЗаполнено(LastHeartbeat) Тогда
		Возврат НСтр("ru = 'Heartbeat: —'; en = 'Heartbeat: —'");
	КонецЕсли;

	Секунд = Цел(Текущая - LastHeartbeat);
	Если Секунд < 0 Тогда
		Секунд = 0;
	КонецЕсли;

	Возврат СтрШаблон(
		НСтр("ru = 'Heartbeat: %1 сек назад'; en = 'Heartbeat: %1 sec ago'"),
		Формат(Секунд, "ЧГ=0; ЧДЦ=0"));

КонецФункции

// UI-12: клиентский аналог ПредставлениеHeartbeat — пересчёт «N сек назад» на
// каждом тике ОбновитьHeartbeat без обращения к серверу (вариант A). Формула
// идентична серверной (N = Цел(Текущая - LastHeartbeat), клипп в 0); дублируется,
// т. к. &НаСервереБезКонтекста-функции недоступны из клиентского контекста.
//
// Параметры:
//   LastHeartbeat - Дата - реквизит формы ШапкаLastHeartbeat.
//   Текущая       - Дата - ТекущаяДата() на клиенте на момент тика.
//
// Возвращаемое значение:
//   Строка - локализованный текст индикатора.
//
&НаКлиенте
Функция ПредставлениеHeartbeatНаКлиенте(Знач LastHeartbeat, Знач Текущая)

	Если НЕ ЗначениеЗаполнено(LastHeartbeat) Тогда
		Возврат НСтр("ru = 'Heartbeat: —'; en = 'Heartbeat: —'");
	КонецЕсли;

	Секунд = Цел(Текущая - LastHeartbeat);
	Если Секунд < 0 Тогда
		Секунд = 0;
	КонецЕсли;

	Возврат СтрШаблон(
		НСтр("ru = 'Heartbeat: %1 сек назад'; en = 'Heartbeat: %1 sec ago'"),
		Формат(Секунд, "ЧГ=0; ЧДЦ=0"));

КонецФункции

// UI-12: финальность статуса запуска — для финальных статусов heartbeat больше
// не обновляется бэкендом (ar_AuditЗапуски.Heartbeat вызывается только из
// активного цикла), поэтому клиентский таймер автообновления не подключается
// (см. ЗаполнитьШапку/ПриОткрытии) — иначе «N сек назад» рос бы неограниченно
// для давно завершённых запусков (см. D4/«Граничные случаи» спеки UI-12).
//
// Финальные значения соответствуют Перечисление.ar_СтатусЗапуска: Completed,
// Failed, Cancelled, MaxStepsReached, DeniedGlobally, Interrupted,
// FailedIncompatibleState. Нефинальные: Created, Running, PausedForApproval.
//
// Interrupted включён в финальные намеренно: см. Enums/ar_СтатусЗапуска.xml,
// EnumValue Interrupted - "Финальный статус: heartbeat пропал дольше порога,
// сервер упал". Регламентное ar_ОчисткаЗависших (SCHED-04) переводит запуск
// в Interrupted именно когда ar_LastHeartbeat устарел дольше
// ar_HeartbeatПорогСек - то есть heartbeat для такого запуска заведомо не
// обновляется бэкендом, и автообновляющийся счётчик "N сек назад" ему не
// нужен (значение уже "истекло" и зафиксировано). Возможность ручного
// возобновления Interrupted-запуска (UI-13, КнопкаВозобновить) - отдельный
// от heartbeat-индикатора UX-сценарий, не влияет на эту классификацию.
//
// Параметры:
//   Статус - ПеречислениеСсылка.ar_СтатусЗапуска - статус запуска (Шапка.Статус).
//
// Возвращаемое значение:
//   Булево - Истина, если статус финальный.
//
&НаСервереБезКонтекста
Функция СтатусФинальный(Знач Статус)

	Возврат Статус = Перечисления.ar_СтатусЗапуска.Completed
		ИЛИ Статус = Перечисления.ar_СтатусЗапуска.Failed
		ИЛИ Статус = Перечисления.ar_СтатусЗапуска.Cancelled
		ИЛИ Статус = Перечисления.ar_СтатусЗапуска.MaxStepsReached
		ИЛИ Статус = Перечисления.ar_СтатусЗапуска.DeniedGlobally
		ИЛИ Статус = Перечисления.ar_СтатусЗапуска.Interrupted
		ИЛИ Статус = Перечисления.ar_СтатусЗапуска.FailedIncompatibleState;

КонецФункции

// Локализованный прочерк-заглушка для незаполненных полей.
//
&НаСервереБезКонтекста
Функция Прочерк()
	Возврат НСтр("ru = '—'; en = '—'");
КонецФункции

// Формат целого числа без дробной части и разделителей групп.
//
&НаСервереБезКонтекста
Функция ЦелоеСтрокой(Знач Число)
	Возврат Формат(Число, "ЧГ=0; ЧДЦ=0");
КонецФункции

#КонецОбласти
